In [1]:
print("hello world")

hello world

In [2]:
a=5
a

5

## pandas 
veri analizi ve veri manipülasyonu için kullanılan bir kütüphane

In [9]:
import pandas as pd

### pandas series
tek boyutlu bir dizidir (exceldeki tek sütun gibi)

In [7]:
series1 = pd.Series([10,20,30,40,50])
series1

0    10
1    20
2    30
3    40
4    50
dtype: int64

## pandas dataframe (tablo)
birden fazla sutün içeren tablo(excel)

In [18]:
data = { "Ad": ["Ali","Ayşe","Mehmet","Zeynep"], "Yaş":[25,30,35,40], "Şehir": ["İstanbul","Ankara","İzmir","Bursa"] }

In [19]:
df1 = pd.DataFrame(data)
df1

       Ad  Yaş     Şehir
0     Ali   25  İstanbul
1    Ayşe   30    Ankara
2  Mehmet   35     İzmir
3  Zeynep   40     Bursa

In [14]:
df2 = pd.read_csv("Chocolate Sales.csv")
df2

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [15]:
#ilk 5 veri
df2.head(n=5)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

In [16]:
#son 5 veri
df2.tail(n=5)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [20]:
df2.isnull().sum()

Sales Person     0
Country          0
Product          0
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

In [21]:
df2.isnull().any()

Sales Person     False
Country          False
Product          False
Date             False
Amount           False
Boxes Shipped    False
dtype: bool

In [22]:
df2[ df2["Boxes Shipped"] > 300  ]

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
15,Beverie Moffet,Australia,Organic Choco Syrup,26-Jan-22,"$6,790",356
25,Karlen McCaffrey,India,Fruit & Nut Bars,26-Jan-22,$168,321
29,Dennison Crosswaite,New Zealand,Manuka Honey Choco,15-Jun-22,"$5,061",301
35,Roddy Speechley,USA,Manuka Honey Choco,22-Jul-22,"$9,583",315
...,...,...,...,...,...,...
1077,Oby Sorrel,Canada,Orange Choco,27-Apr-22,"$8,757",338
1083,Madelene Upcott,New Zealand,Milk Bars,29-Mar-22,"$12,558",403
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [23]:
df2["Boxes Shipped"]

0       180
1        94
2        91
3       342
4       184
       ...
1089    323
1090    119
1091    217
1092    384
1093    344
Name: Boxes Shipped, Length: 1094, dtype: int64

In [24]:
df2["Amount"]

0        $5,320
1        $7,896
2        $4,501
3       $12,726
4       $13,685
          ...
1089     $4,410
1090     $6,559
1091       $574
1092     $2,086
1093     $5,075
Name: Amount, Length: 1094, dtype: object

In [25]:
df2.sample(n=10)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
555,Kelci Walkden,USA,Spicy Special Slims,29-Apr-22,$77,69
151,Oby Sorrel,India,Smooth Sliky Salty,07-Feb-22,"$10,101",108
1030,Husein Augar,UK,After Nines,05-Jul-22,"$3,507",380
91,Madelene Upcott,India,Raspberry Choco,07-Jul-22,"$4,221",9
865,Kaine Padly,New Zealand,Smooth Sliky Salty,12-Apr-22,$7,518
454,Camilla Castle,New Zealand,Spicy Special Slims,25-Jan-22,"$11,564",24
942,Roddy Speechley,Australia,85% Dark Bars,08-Jul-22,"$4,200",80
908,Curtice Advani,Australia,Caramel Stuffed Bars,14-Feb-22,"$9,114",140
196,Barr Faughny,New Zealand,Raspberry Choco,29-Jul-22,"$6,468",66
952,Karlen McCaffrey,Canada,Caramel Stuffed Bars,02-Mar-22,"$3,346",304

In [26]:
df3 = pd.read_csv("Chocolate Sales2.csv")
df3

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",NaN
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94.0
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91.0
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",NaN
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184.0
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323.0
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119.0
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217.0
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384.0
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344.0

In [27]:
df3.isnull()

      Sales Person  Country  Product   Date  Amount  Boxes Shipped
0            False    False    False  False   False           True
1            False    False    False  False   False          False
2            False    False    False  False   False          False
3            False    False    False  False   False           True
4            False    False    False  False   False          False
...            ...      ...      ...    ...     ...            ...
1089         False    False    False  False   False          False
1090         False    False    False  False   False          False
1091         False    False    False  False   False          False
1092         False    False    False  False   False          False
1093         False    False    False  False   False          False

[1094 rows x 6 columns]

In [28]:
df3.isnull().any()

Sales Person     False
Country           True
Product           True
Date              True
Amount            True
Boxes Shipped     True
dtype: bool

In [29]:
df3.isnull().sum()

Sales Person     0
Country          1
Product          5
Date             3
Amount           1
Boxes Shipped    8
dtype: int64

In [30]:
df3["Boxes Shipped"].mean()

161.76887661141805

In [31]:
df3["Country"].mode()

0    Australia
dtype: object

In [32]:
df3["Boxes Shipped"].median()

135.0

In [33]:
df3["Boxes Shipped"] = df3["Boxes Shipped"].fillna(  df3["Boxes Shipped"].mean() )

In [34]:
df3.isnull().sum()

Sales Person     0
Country          1
Product          5
Date             3
Amount           1
Boxes Shipped    0
dtype: int64

In [35]:
df3.head(10)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",161.768877
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94.000000
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91.000000
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",161.768877
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184.000000
5,Van Tuxwell,India,Smooth Sliky Salty,06-Jun-22,"$5,376",38.000000
6,Oby Sorrel,UK,99% Dark & Pure,25-Jan-22,"$13,685",176.000000
7,Gunar Cockshoot,Australia,After Nines,24-Mar-22,"$3,080",73.000000
8,Jehu Rudeforth,New Zealand,50% Dark Bites,20-Apr-22,"$3,990",59.000000
9,Brien Boise,Australia,99% Dark & Pure,04-Jul-22,"$2,835",102.000000

In [1]:
import pandas as pd
dataFrame1 = pd.read_csv("Chocolate Sales2.csv") 
dataFrame1.isnull().sum()

Sales Person     0
Country          1
Product          5
Date             3
Amount           1
Boxes Shipped    8
dtype: int64

In [7]:
dataFrame1["Boxes Shipped"]

0         NaN
1        94.0
2        91.0
3         NaN
4       184.0
        ...
1089    323.0
1090    119.0
1091    217.0
1092    384.0
1093    344.0
Name: Boxes Shipped, Length: 1094, dtype: float64

In [10]:
dataFrame1["Boxes Shipped"] = dataFrame1["Boxes Shipped"].fillna(dataFrame1["Boxes Shipped"].mean())
dataFrame1["Boxes Shipped"],dataFrame1.isnull().sum()

(0       161.768877
 1        94.000000
 2        91.000000
 3       161.768877
 4       184.000000
            ...
 1089    323.000000
 1090    119.000000
 1091    217.000000
 1092    384.000000
 1093    344.000000
 Name: Boxes Shipped, Length: 1094, dtype: float64,
 Sales Person     0
 Country          1
 Product          5
 Date             3
 Amount           1
 Boxes Shipped    0
 dtype: int64)

In [11]:
dataFrame1["Amount"]

0        $5,320
1        $7,896
2        $4,501
3       $12,726
4       $13,685
          ...
1089     $4,410
1090     $6,559
1091       $574
1092     $2,086
1093     $5,075
Name: Amount, Length: 1094, dtype: object

In [13]:
dataFrame1["Amount"]= dataFrame1["Amount"].astype(str).replace("[$,]","",regex = True).astype(float)
dataFrame1["Amount"]

0        5320.0
1        7896.0
2        4501.0
3       12726.0
4       13685.0
         ...
1089     4410.0
1090     6559.0
1091      574.0
1092     2086.0
1093     5075.0
Name: Amount, Length: 1094, dtype: float64

In [14]:
dataFrame1["Amount"]=dataFrame1["Amount"].fillna(dataFrame1["Amount"].mean())
dataFrame1.isnull().sum()

Sales Person     0
Country          1
Product          5
Date             3
Amount           0
Boxes Shipped    0
dtype: int64

In [15]:
dataFrame1["Date"]= dataFrame1["Date"].fillna(method="ffill").fillna(method="bfill")
dataFrame1.isnull().sum()

Sales Person     0
Country          1
Product          5
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

In [19]:
dataFrame1['Country'].mode()

0    Australia
dtype: object

In [20]:
dataFrame1["Country"]=dataFrame1["Country"].fillna(dataFrame1['Country'].mode()[0])
dataFrame1.isnull().sum()

Sales Person     0
Country          0
Product          5
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

In [21]:
data = {
"Product": ["A", "B", "A", "B", "A", "C", "C"],
"Amount": [100, 200, 150, 250, None, 300, None]
}

In [24]:
dataFrame2= pd.DataFrame(data)
dataFrame2.head(3)

  Product  Amount
0       A   100.0
1       B   200.0
2       A   150.0

In [25]:
dataFrame2["Amount"].mean()

200.0

In [26]:
dataFrame2.groupby("Product")["Amount"].mean()

Product
A    125.0
B    225.0
C    300.0
Name: Amount, dtype: float64

## productu doldururken her bir sales person için boş ürünü, o kişinin en cok sattıgı ürün ile doldurunuz.
## group by